import "./conditions.css"
import React, {useState} from 'react';

const Conditions = (props) => {

    // const [exit, setExit] = useState(false);
    const conditions = [
        "نماینده و سایر اعضا متعهدند مقررات خاص فضای کار اشتراکی و ساعت کاری فضا را رعایت نمایند.",
        "نماینده و سایر اعضا متعهدند فقط در زمان توافق شده و از مکان تعیین شده استفاده نمایند.",
        "نماینده و سایر اعضا متعهدند در ابتدای مراجعه روزانه به فضا، رسید پرداخت هزینه و کارت شناسایی معتبر به همراه داشته باشند.",
        "نماینده و سایر اعضا متعهدند منشور اخلاقي، آيين نامه‌ها، دستور العمل‌ها و بخشنامه‌هاي پارك علم و فناوري دانشگاه تهران، " +
        "ضوابط و مقررات و استانداردهاي اداري، فني و ايمني، بهداشتي، محيط زيستي، انساني، اجتماعي، فرهنگي، اسلامي، اخلاقي و ساير مقررات مربوطه را رعايت نمايند. ",
        "تیم‌ها به هیچ عنوان حق استفاده از لوگو و نام دانشگاه تهران و پارک علم و فناوری را در هیچ کدام از موارد تبلیغاتی " +
        "ندارند. در صورت تخلف از این مورد، ضمن اینکه می‌بایست بلافاصله نسبت به امحاء نام و لوگو اقدام نمایند، از ادامه حضور در فضای کار اشتراکی نیز محروم می‌شوند.",
        "تیم‌ها و کلیه اشخاص حقیقی و حقوقی، مجاز به استفاده کتبی از نشانی پارک علم و فناوری دانشگاه تهران در هیچ شرایطی نمی‌باشند و در " +
        "صورت تخلف، ضمن اینکه می‌بایست بلافاصله نسبت به امحاء نشانی اقدام نمایند از ادامه حضور در فضای کار اشتراکی پارک علم و فناوری دانشگاه تهران نیز محروم می‌شوند. ",
        "نماینده و سایر اعضا متعهد به حفظ محرمانگی و مالکیت معنوی " +
        "اطلاعاتی هستند که حسب مورد توسط پارک یا واحدهای فناور (هسته‌ها و شرکت‌ها) عضو پارک یا سایر اشخاص حاضر در فضای کار اشتراکی در اختیار ایشان قرار گرفته یا به واسطه " +
        "حضور در محیط پارک به آن دسترسی دارند. از جمله: اسناد، مدارک، قرارداد، دانش فنی، اطلاعات مالی، محاسباتی، سخت افزارها، نرم افزارها و سایر اطلاعات مربوط به ایده‌ها، " +
        "طرح‌ها و پروپوزال‌ها در هر قالبی که باشد اعم از اینکه قید محرمانه داشته باشد یا نداشته باشد و نماینده می بایست سایر اعضا را ملزم به عدم افشای اطلاعات مذکور نماید.",
        "نماینده متعهد است از حضور مهمان یا سایر افراد معرفی نشده در فضای کار اشتراکی خودداری نماید.",
        "نماینده متعهد است برای حضور خبرنگاران و ارباب جراید از قبل با پارک هماهنگی نماید. در غیر اینصورت از ورود ایشان جلوگیری خواهد شد.",
        "نماینده متعهد است برای پخش یا نصب هرگونه آگهی، پلاکارد و ... از قبل با پارک هماهنگی نموده و مجوز لازم را اخذ نماید.",
        "نماینده متعهد است هزینه" +
        " خدمات را به صورت نقدی در ابتدای زمان استقرار یا به صورت اقساط با ارائه چک انجام دهد. به هر صورت می بایست همزمان با پایان استقرار، کلیه هزینه‌ها تسویه شده باشد.",
        "نماینده متعهد می‌شود بعد از اتمام زمان استقرار، باقیمانده هزینه خدمات و هزینه خسارات احتمالی ناشی از فعالیت وی یا سایر اعضا را پرداخت نماید.",
        "نماینده و سایر اعضا نسبت به تخلفاتی که منجر به نقض مفاد این تعهد نامه گردد، مسئولیت تضامنی خواهند داشت."
    ]
    const items = [];

    conditions.forEach((c, i) => {
        items.push(<li className="pe-3 mb-2" key={i}>{c}</li>)
    })


    return (
        <div className= "register-conditions col-12">
            <ul>
                {items}
                <li onClick={props.onExit}>خروج</li>
            </ul>
        </div>

    );
};

export default Conditions;