"use strict";
module.exports={name:"persian_fa",
    months:[["فروردین","فر"],
        ["اردیبهشت","ار"],
        ["خرداد","خرد"],
        ["تیر","تیر"],
        ["مرداد","مر"],
        ["شهریور","شه"],
        ["مهر","مه"],
        ["آبان","آبا"],
        ["آذر","آذ"],
        ["دی","دی"],
        ["بهمن","بهم"]
        ,["اسفند","اسف"]]
    ,weekDays:[["شنبه","ش"],
        ["یکشنبه","ی"],
        ["دوشنبه","د"],
        ["سه شنبه","س"],
        ["چهارشنبه","چ"],
        ["پنجشنبه","پ"],
        ["جمعه","ج"]]
    ,digits:["۰","۱","۲","۳","۴","۵","۶","۷","۸","۹"],
    meridiems:[["قبل از ظهر","ق.ظ"],["بعد از ظهر","ب.ظ"]]};
